virusCrusader_proj/VirusCrusader.org
VirusCrusader concept 
| 2011/03/15 | ver1.0  | たたき台    　                    |
| 2011/4/1   | ver1.1  | 直し                              |
| 2011/4/10  | ver1.2  | 追加                              |
| 2011/4/14  | ver1.3  | 表示設定変更                      |
| 2011/4/18  | ver1.4  | 一部訂正　                        |
| 2011/4/24  | ver1.5  | 計算式追加　                      |
| 2011/5/5   | ver1.6  | rule改訂&graphic view追加         |
| 2011/5/7   | ver1.7  | help機能の追加、wash out(refresh) |
| 2011/5/15  | ver 1.8 | view 整理                         |
|            |         |                                   |



* view
** start view
  + title
  + button
   - Setting : move setting view
   - Play :start game
   - Record: show record

** setting view
  + button
   - Set:setting value
   - Play :start game
   - Record: show record
   
*** game speed
    | slow   | 1 splitting / min |
    | normal | 2 splitting / min |
    | fast   | 3 splitting / min |
    
*** game level
    | level    | speed           | stage | variant |
    |----------+-----------------+-------+---------|
    | practice | slow            |     1 | none    |
    | normal   | slow and normal |     2 | +       |
    | random   | normal and fast |    10 | ++      |

** game main view
   + イベント・行動履歴を記録する.
    何時、何をしたかを表示する.

   + report形式で進行させる.
    reportは一定時間ごとにアップする形式とする.

   + message windowを設置する 
     - new report up
     - new medicine comes
     - worning:variant was raiseなど
   
   + 色を変える、点滅させる

   + button
    - Medicin:move medicin making view
    - Report :move Report list view
    - Analuze: move Analze setting view

** Report list view
   + デフォルトの表示
   + table view形式で菌の状態を表示する(縦横をきちんと整列させること!)
   
   + button
    - Medicin:move medicin making view
    - Main :move game main view
    - Analuze: move Analze setting view
    
** medicine making view
   medicine making
   
   + button
     - Refresh:Mediun all refresh(すべての薬物濃度を0にする)　=>　必ずアラートを出す
     - Amount: amount setting
     - Kind: setting kind of medicin:
       S,P,C,L,K
     - Make: make medicine following setting
     - State: move medicin conc view
     - Done: move game main view

** medicine conc view
   display medicin conc list (Graphical?)

   + button
    -  Back: move medicin making view
   
** analyze setting view
   analyze setting

   + button
     - researcher:
     - report level:depend on report level %

     | name   | cost | rest time | speed % | report level % | description |
     |--------+------+-----------+---------+----------------+-------------|
     | susumu |      |           |         |                |             |
     | hideki |      |           |         |                | normal      |
     | shin   |      |           |         |                | normal      |
     | reo    |      |           |         |                | normal      |
     | makoto |      |           |         |                | normal      |
     | masu   |      |           |         |                | rand        |
     | ken    |      |           |         |                | rand        |
     | ryou   |      |           |         |                | rand        |
     | kou    |      |           |         |                | rand        |
     | akira  |      |           |         |                | rand        |
     | eichi  |      |           |         |                | rand        |


     - Report grade: basic, advance, entiry
     - set:set researcher
     - Done:move game main view

** record view
   
   + Longest play time
     - play level
     - play speed
     - time
     -  date

   + Lowest cost play
     - play level
     - play speed
     - cost
     -  date

** result view
  + game level
  + game speed
  + play time
  + play cost

** game end view
   Display "game over" 
   and " game clear"

** help view
   各viewに合わせたヘルプを表示する
   そのためにはstateを設定する。
   stateによって表示内容を変更する

* Rule
** game clear and end
   1) 菌数0でGame Clear
   2) すべてのkinが耐性を得た場合Game Over
   3) 予算が0になったらGame Over
   4) kin数の上限10＾9個以上になったらGame Over
   
