virusCrusader_proj/VirusCrusader.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>VirusCrusader concept</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-05-20 06:43:59 JST"/>
<meta name="author" content="清水 一征"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">VirusCrusader concept</h1>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>2011/03/15</td><td>ver1.0</td><td>たたき台    　</td></tr>
<tr><td>2011/4/1</td><td>ver1.1</td><td>直し</td></tr>
<tr><td>2011/4/10</td><td>ver1.2</td><td>追加</td></tr>
<tr><td>2011/4/14</td><td>ver1.3</td><td>表示設定変更</td></tr>
<tr><td>2011/4/18</td><td>ver1.4</td><td>一部訂正　</td></tr>
<tr><td>2011/4/24</td><td>ver1.5</td><td>計算式追加　</td></tr>
<tr><td>2011/5/5</td><td>ver1.6</td><td>rule改訂&amp;graphic view追加</td></tr>
<tr><td>2011/5/7</td><td>ver1.7</td><td>help機能の追加、wash out(refresh)</td></tr>
<tr><td>2011/5/15</td><td>ver 1.8</td><td>view 整理</td></tr>
</tbody>
</table>





<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 view </a>
<ul>
<li><a href="#sec-1.1">1.1 start view </a></li>
<li><a href="#sec-1.2">1.2 setting view </a>
<ul>
<li><a href="#sec-1.2.1">1.2.1 game speed </a></li>
<li><a href="#sec-1.2.2">1.2.2 game level </a></li>
</ul>
</li>
<li><a href="#sec-1.3">1.3 game main view </a></li>
<li><a href="#sec-1.4">1.4 Report list view </a></li>
<li><a href="#sec-1.5">1.5 medicine making view </a></li>
<li><a href="#sec-1.6">1.6 medicine conc view </a></li>
<li><a href="#sec-1.7">1.7 analyze setting view </a></li>
<li><a href="#sec-1.8">1.8 record view </a></li>
<li><a href="#sec-1.9">1.9 result view </a></li>
<li><a href="#sec-1.10">1.10 game end view </a></li>
<li><a href="#sec-1.11">1.11 help view </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Rule </a>
<ul>
<li><a href="#sec-2.1">2.1 game clear and end </a></li>
<li><a href="#sec-2.2">2.2 kinに関して </a>
<ul>
<li><a href="#sec-2.2.1">2.2.1 変異には2種類ある </a></li>
</ul>
</li>
<li><a href="#sec-2.3">2.3 medicineに関して </a></li>
<li><a href="#sec-2.4">2.4 reportに関して </a>
<ul>
<li><a href="#sec-2.4.1">2.4.1 report作成には時間とcostが掛かる </a></li>
<li><a href="#sec-2.4.2">2.4.2 reportはレポート形式で表示する </a></li>
</ul>
</li>
<li><a href="#sec-2.5">2.5 analyzeに関して </a>
<ul>
<li><a href="#sec-2.5.1">2.5.1 analyzeはresearcher(キャラクター)に大きく依存する </a></li>
<li><a href="#sec-2.5.2">2.5.2 researcherには得意なことがある </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 Medicine </a>
<ul>
<li><a href="#sec-3.1">3.1 medicine type </a></li>
<li><a href="#sec-3.2">3.2 medicine level </a></li>
</ul>
</li>
<li><a href="#sec-4">4 kin(菌) </a>
<ul>
<li><a href="#sec-4.1">4.1 菌のタイプ(5つ) </a></li>
<li><a href="#sec-4.2">4.2 タイプによって薬剤耐性が異なる </a></li>
<li><a href="#sec-4.3">4.3 菌同士の相性 </a></li>
<li><a href="#sec-4.4">4.4 菌の表示方法 </a></li>
</ul>
</li>
<li><a href="#sec-5">5 calculate </a>
<ul>
<li><a href="#sec-5.1">5.1 菌の増加曲線 </a></li>
<li><a href="#sec-5.2">5.2 菌の相性計算 </a></li>
<li><a href="#sec-5.3">5.3 菌の変異確率計算 </a></li>
<li><a href="#sec-5.4">5.4 medicineによる菌の減少曲線 </a></li>
<li><a href="#sec-5.5">5.5 medicineのFlow rate(洗い流しの影響) </a></li>
<li><a href="#sec-5.6">5.6 report graph </a></li>
</ul>
</li>
<li><a href="#sec-6">6 Class </a>
<ul>
<li><a href="#sec-6.1">6.1 kin Class </a></li>
<li><a href="#sec-6.2">6.2 medicine Class </a></li>
<li><a href="#sec-6.3">6.3 viewContorller Class </a></li>
<li><a href="#sec-6.4">6.4 kinController Class </a></li>
<li><a href="#sec-6.5">6.5 experimental Class </a></li>
<li><a href="#sec-6.6">6.6 medicinceControll Class </a></li>
<li><a href="#sec-6.7">6.7 report Class </a></li>
<li><a href="#sec-6.8">6.8 researcher Class </a></li>
</ul>
</li>
<li><a href="#sec-7">7 idea 保留 </a>
<ul>
<li><a href="#sec-7.1">7.1 title 候補 </a></li>
<li><a href="#sec-7.2">7.2 Description </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> view </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> start view </h3>
<div class="outline-text-3" id="text-1.1">

<ul>
<li>
title
</li>
<li>
button
<ul>
<li>
Setting : move setting view
</li>
<li>
Play :start game
</li>
<li>
Record: show record

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> setting view </h3>
<div class="outline-text-3" id="text-1.2">

<ul>
<li>
button
<ul>
<li>
Set:setting value
</li>
<li>
Play :start game
</li>
<li>
Record: show record

</li>
</ul>
</li>
</ul>

</div>

<div id="outline-container-1.2.1" class="outline-4">
<h4 id="sec-1.2.1"><span class="section-number-4">1.2.1</span> game speed </h4>
<div class="outline-text-4" id="text-1.2.1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>slow</td><td>1 splitting / min</td></tr>
<tr><td>normal</td><td>2 splitting / min</td></tr>
<tr><td>fast</td><td>3 splitting / min</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-1.2.2" class="outline-4">
<h4 id="sec-1.2.2"><span class="section-number-4">1.2.2</span> game level </h4>
<div class="outline-text-4" id="text-1.2.2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">level</th><th scope="col">speed</th><th scope="col">stage</th><th scope="col">variant</th></tr>
</thead>
<tbody>
<tr><td>practice</td><td>slow</td><td>1</td><td>none</td></tr>
<tr><td>normal</td><td>slow and normal</td><td>2</td><td>+</td></tr>
<tr><td>random</td><td>normal and fast</td><td>10</td><td>++</td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> game main view </h3>
<div class="outline-text-3" id="text-1.3">

<ul>
<li>
イベント・行動履歴を記録する.
何時、何をしたかを表示する.

</li>
<li>
report形式で進行させる.
reportは一定時間ごとにアップする形式とする.

</li>
<li>
message windowを設置する 
<ul>
<li>
new report up
</li>
<li>
new medicine comes
</li>
<li>
worning:variant was raiseなど

</li>
</ul>
</li>
<li>
色を変える、点滅させる

</li>
<li>
button
<ul>
<li>
Medicin:move medicin making view
</li>
<li>
Report :move Report list view
</li>
<li>
Analuze: move Analze setting view

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> Report list view </h3>
<div class="outline-text-3" id="text-1.4">

<ul>
<li>
デフォルトの表示
</li>
<li>
table view形式で菌の状態を表示する(縦横をきちんと整列させること!)

</li>
<li>
button
<ul>
<li>
Medicin:move medicin making view
</li>
<li>
Main :move game main view
</li>
<li>
Analuze: move Analze setting view

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5"><span class="section-number-3">1.5</span> medicine making view </h3>
<div class="outline-text-3" id="text-1.5">

<p>medicine making
</p>
<ul>
<li>
button
<ul>
<li>
Refresh:Mediun all refresh(すべての薬物濃度を0にする)　=&gt;　必ずアラートを出す
</li>
<li>
Amount: amount setting
</li>
<li>
Kind: setting kind of medicin:
S,P,C,L,K
</li>
<li>
Make: make medicine following setting
</li>
<li>
State: move medicin conc view
</li>
<li>
Done: move game main view

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.6" class="outline-3">
<h3 id="sec-1.6"><span class="section-number-3">1.6</span> medicine conc view </h3>
<div class="outline-text-3" id="text-1.6">

<p>display medicin conc list (Graphical?)
</p>
<ul>
<li>
button
<ul>
<li>
 Back: move medicin making view

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.7" class="outline-3">
<h3 id="sec-1.7"><span class="section-number-3">1.7</span> analyze setting view </h3>
<div class="outline-text-3" id="text-1.7">

<p>analyze setting
</p>
<ul>
<li>
button
<ul>
<li>
researcher:
</li>
<li>
report level:depend on report level %

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">name</th><th scope="col">cost</th><th scope="col">rest time</th><th scope="col">speed %</th><th scope="col">report level %</th><th scope="col">description</th></tr>
</thead>
<tbody>
<tr><td>susumu</td><td></td><td></td><td></td><td></td><td></td></tr>
<tr><td>hideki</td><td></td><td></td><td></td><td></td><td>normal</td></tr>
<tr><td>shin</td><td></td><td></td><td></td><td></td><td>normal</td></tr>
<tr><td>reo</td><td></td><td></td><td></td><td></td><td>normal</td></tr>
<tr><td>makoto</td><td></td><td></td><td></td><td></td><td>normal</td></tr>
<tr><td>masu</td><td></td><td></td><td></td><td></td><td>rand</td></tr>
<tr><td>ken</td><td></td><td></td><td></td><td></td><td>rand</td></tr>
<tr><td>ryou</td><td></td><td></td><td></td><td></td><td>rand</td></tr>
<tr><td>kou</td><td></td><td></td><td></td><td></td><td>rand</td></tr>
<tr><td>akira</td><td></td><td></td><td></td><td></td><td>rand</td></tr>
<tr><td>eichi</td><td></td><td></td><td></td><td></td><td>rand</td></tr>
</tbody>
</table>



</li>
<li>
Report grade: basic, advance, entiry
</li>
<li>
set:set researcher
</li>
<li>
Done:move game main view

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.8" class="outline-3">
<h3 id="sec-1.8"><span class="section-number-3">1.8</span> record view </h3>
<div class="outline-text-3" id="text-1.8">


<ul>
<li>
Longest play time
<ul>
<li>
play level
</li>
<li>
play speed
</li>
<li>
time
</li>
<li>
 date

</li>
</ul>
</li>
<li>
Lowest cost play
<ul>
<li>
play level
</li>
<li>
play speed
</li>
<li>
cost
</li>
<li>
 date

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.9" class="outline-3">
<h3 id="sec-1.9"><span class="section-number-3">1.9</span> result view </h3>
<div class="outline-text-3" id="text-1.9">

<ul>
<li>
game level
</li>
<li>
game speed
</li>
<li>
play time
</li>
<li>
play cost

</li>
</ul>
</div>

</div>

<div id="outline-container-1.10" class="outline-3">
<h3 id="sec-1.10"><span class="section-number-3">1.10</span> game end view </h3>
<div class="outline-text-3" id="text-1.10">

<p>Display "game over" 
and " game clear"
</p>
</div>

</div>

<div id="outline-container-1.11" class="outline-3">
<h3 id="sec-1.11"><span class="section-number-3">1.11</span> help view </h3>
<div class="outline-text-3" id="text-1.11">

<p>各viewに合わせたヘルプを表示する
そのためにはstateを設定する。
stateによって表示内容を変更する
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Rule </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> game clear and end </h3>
<div class="outline-text-3" id="text-2.1">

<ol>
<li>
菌数0でGame Clear
</li>
<li>
すべてのkinが耐性を得た場合Game Over
</li>
<li>
予算が0になったらGame Over
</li>
<li>
kin数の上限10＾9個以上になったらGame Over

</li>
</ol>
</div>

</div>
