virusCrusader_proj/VirusCrusader.org
** kinに関して
   1. 菌数の上限は10＾9個
   2. 菌数減少でcost get
   3. 菌は時間経過によって指数対数的に増加する
   4. 菌は一定の確率で薬剤耐性を得る(変異)

*** 変異には2種類ある

    + 増殖速度変異(gv) :: 増殖速度が増加する
    + 薬剤耐性変異(rv) :: 薬剤耐性を獲得する確率が変化する 

** medicineに関して
   1. medicineの投入によって菌数は減少
   2. medicineには種類(type)と強さ(level)が有る
   3. medicineにはcostと時間が必要
   4. medicineには相互作用があり、medicineを増強減弱する(Player unknown)
   5. medicineは一定時間ごとに洗い流され濃度が減少する(効果減)
   6. medicineのトータルは100%(無効になった薬物はGarbageと表現)
   7. refresh :: すべての薬物濃度を０にする
   8. medicineは5つまでしか作れない(消費するまで)


+ ex ::  
          - S.vw 10%, P.s 10% Garbage 80%
          - 一定時間後
          - S.vw 5%, P.s 5% Garbage 90%  

** reportに関して
*** report作成には時間とcostが掛かる
    reportにはgradeがある
 
| grade    | cost | time |
|----------+------+------|
| basic    |   10 |    1 |
| advance  |   20 |   10 |
| entirely |   40 |  100 |

*** reportはレポート形式で表示する
    + グラフ表示を入れる
    + レポートには時刻と菌のmedicinを表示する

**** list view
***** list viewにはgradeがある
      + 非表示項目は* ::
      shape(gv%,rv%):菌数
      (S_P_C_L_K)

      + basic(basic_grade) ::
      shape(*):number
      (*****)

      + advance(advanve_grade) ::
      shape(gv%,rv%):number
      (*****)

      + entirely(entirely_grade) ::
      shape(gv%,rv%):number
      (S_P_C_L_K)

** analyzeに関して
*** analyzeはresearcher(キャラクター)に大きく依存する
    + researcherを何人か用意する。
    + researcherにはレベルがある。
    + researcher によってコストと時間と情報量が異なる。
    + 一度reportを作成したresearcherは少し休暇が必要。

*** researcherには得意なことがある
    つまり、report Gradeによって作業とコストが変化する
     
* Medicine
** medicine type
  + シリン系(S)
  + ポリン系(P)
  + コシド系(C)
  + ライド系(L)
  + クリン系(K)

** medicine level
Researcher classがアルゴリズムに従って決定する
  + very weak(vw)
  + weak(w)
  + moderate(m)
  + strong(s)
  + very strong(vs)

* kin(菌)
** 菌のタイプ(5つ)
   + 丸型(round,RO)
   + 三角型(triangle,TR)
   + 四角型(squre,SQ)
   + 楕円型(ellipse,EL)
   + 星形型(star,ST)

** タイプによって薬剤耐性が異なる
   良く効く>普通>効きにくい 

   + round ::   S>P>C>L>K
   + triangle ::  P>C>L>K>S
   + squre ::     C>L>K>S>P
   + ellipse ::   L>K>S>P>C
   + star ::      K>S>P>C>L

** 菌同士の相性
   隣り合わせの相性
   + R>>T>>SQ>>E>>ST
   例)　R1個あると一定時間ごとにT10を減らす
   
   + 一つ置きの相性
    - R>SQ
    - T>E
    - SQ>ST
    - E>R
    - ST>T

   例)
   R1個あると一定時間ごとにSQ5個減らす

** 菌の表示方法
   + shape(gv%,rv%):菌数
   (S_P_C_L_K)

   + 例1) 丸型タイプでシリン系耐性が50％,100個の場合 ::
   round(0,0)：100
   (50_00_00_00_00)

   + 例2）丸型タイプでシリン系耐性50％で増殖速度変異30%upの場合 ::
   round(gv30):1000
   (50_00_00_00_00)

   + 例3）丸型タイプでシリン系耐性50％で増殖速度変異30%upが10000個ある場合 ::
   round(gv50):10^4
   (50_00_00_00_00)

   + 例4）丸型タイプで全薬剤耐性が10％で増殖変異10%が10000個の場合 ::
   round(gv10):10^4
   (10_10_10_10_10)
   

* calculate
  gv,rvの最大値は99%

  薬剤耐性の最大値は99%
  
  + 殺菌力　基本(sakin) :: medicin 1mol = kin 10 /sec ↓
  + KGU　　　　 :: kin grow up
  + ME        :: medicine effect

  + time t to t' ::
    kin(x) の個数 = kin#(t) x KGU x sigma(ME)

    KGU = GrowUp(x) x (kin-kin)inter

    ME = 　sakin x {(kin-med)inter x 薬剤耐性} x (med-med)inter　x level x amount(t-t')　

  薬剤耐性をどのように表現するか？

** 菌の増加曲線

** 菌の相性計算

** 菌の変異確率計算

** medicineによる菌の減少曲線
   菌数減少量(KDR)

** medicineのFlow rate(洗い流しの影響)

** report graph
   UIColor* colorRed:green:blue:alpha
   Red & alpha:amount of kin
    10^3個以上で

* Class
** kin Class
kinの生成

 - type :: kin種(RO, TR, SQ,  EL, ST)
 - resist :: 菌の薬剤耐性
 - growthRate :: 増殖速度
 - mutateFrequency :: 変異確率
      
      Growth variant (gv)
      Resistance variant (rv)

** medicine Class
medicineの生成
 + kind :: S, P, C ,L, K
 + medicin-level(m-level) :: vw, w, m, s, vs
 + product_cost :: 基本の製造コスト
 + product_time :: 基本の製造時間 

** viewContorller Class
各viewを制御する

　+ help_index :: help表示のため
　+ view_index :: view 切り替えのため

** kinController Class
kinの状態を管理する
菌の種類、菌数を保持する
菌の相性を計算する

** experimental Class
kinとmedicinの時間的、空間的相互作用を管理、計算する
時間、コストを計算する

** medicinceControll Class
medicinの状態を管理する
medicinの種類、濃度を保持する
medicineの相性を計算する

** report Class
結果、条件を表示する
時間、コストを表示する

** researcher Class
      - レベル
      - コスト
      - 合成時間
　　　 - 報告技能
　　　 - 報告時間
      - 復帰時間
      - speciality 
        (ex.sの合成速度は速くなる)
        

* idea 保留
** title 候補
   virus Crisis
   Virus lab crisis
   Out Break
